/**
 * Константы
 */

const ALFA_EARTH_WGS84 = 1.0 / 298.257223563;
const E2_EARTH_WGS84 = 2 * ALFA_EARTH_WGS84 - ALFA_EARTH_WGS84 * ALFA_EARTH_WGS84;

const TranslateConst = Object.freeze( {
    // Точность обработки координат при визуализации
    DELTANULL: (1e-3),

    // Точность обработки координат при выполнении расчетов
    DOUBLENULL: (1e-6),

    // Количество градусов в одном радиане
    RAD: 57.29577951308232,
    TRANSLATEPRECISION: 0.000000001,
    PI2: (2. * Math.PI),

    A_EARTH_WGS84: 6378137.0,
    ALFA_EARTH_WGS84,
    E2_EARTH_WGS84,
    E2_2_EARTH_WGS84: (E2_EARTH_WGS84 / (1. - E2_EARTH_WGS84)),

    A_EARTH: 6378136.0,
    ALFA_EARTH: (1.0 / 298.257839),

    MOD: 0.434294481903251,//827651,

    ALFATO1_EARTH_WGS84: (1.0 - ALFA_EARTH_WGS84),

    k10000: 0.00000001,  // точность в радианах (0.00000001 до 2 см )

    P_03: 206264.806247,      // 1 sec

    M_PI_2: 1.570796326794896,//61923,
    M_PI_4: 0.785398163397448,//309616,


    // Число градусов в 1 радиане
    DEGREEINRAD: 57.29577951308232,

    // Число секунд в 1 радиане
    SECONDINRAD: 206264.806247096,

    // ПЗ-90.02  ->  WGS-84
    DX_SGS85_WGS84: (-0.36),
    DY_SGS85_WGS84: 0.08,
    DZ_SGS85_WGS84: 0.18,
    RX_SGS85_WGS84: 0.0,
    RY_SGS85_WGS84: 0.0,
    RZ_SGS85_WGS84: 0.0,
    M_SGS85_WGS84: 0,

    // ПЗ-90.11  ->  WGS-84
    DX_SGS85_11_WGS84: 0.013,
    DY_SGS85_11_WGS84: (-0.106),
    DZ_SGS85_11_WGS84: (-0.022),
    RX_SGS85_11_WGS84: 0.0023,
    RY_SGS85_11_WGS84: (-0.00354),
    RZ_SGS85_11_WGS84: 0.00421,
    M_SGS85_11_WGS84: 0.000000008,

    // ГСК-2011 ->  WGS-84
    DX_GCK2011_WGS84: 0.013,       // 0.01 - через ПЗ-90.02, 0.01296938 - через ПЗ-90.11
    DY_GCK2011_WGS84: (-0.092),      // (-0.12) - через ПЗ-90.02, -0.0919816 - через ПЗ-90.11
    DZ_GCK2011_WGS84: (-0.03),
    RX_GCK2011_WGS84: 0.001738,
    RY_GCK2011_WGS84: (-0.003559),
    RZ_GCK2011_WGS84: 0.004263,
    M_GCK2011_WGS84: 0.0000000074,

    // СК-95  ->  ПЗ-90.02  (Count: 14)
    DX_S95_SGS85: 24.83,
    DY_S95_SGS85: (-130.97),
    DZ_S95_SGS85: (-81.74),
    RX_S95_SGS85: 0.0,
    RY_S95_SGS85: 0.0,
    RZ_S95_SGS85: (-0.13),
    M_S95_SGS85: (-0.00000022),

    // СК-95  ->  ПЗ-90.11
    DX_S95_SGS85_11: 24.457,
    DY_S95_SGS85_11: (-130.784),
    DZ_S95_SGS85_11: (-81.538),
    RX_S95_SGS85_11: (-0.0023),
    RY_S95_SGS85_11: 0.00354,
    RZ_S95_SGS85_11: (-0.13421),
    M_S95_SGS85_11: (-0.000000228),

    // СК-42  ->  ПЗ-90.02  (Count: 14)
    DX_S42_SGS85: 23.93,
    DY_S42_SGS85: (-141.03),
    DZ_S42_SGS85: (-79.98),
    RX_S42_SGS85: 0.0,
    RY_S42_SGS85: (-0.35),
    RZ_S42_SGS85: (-0.79),
    M_S42_SGS85: (-0.00000022),

    // СК-42  ->  ПЗ-90.11
    DX_S42_SGS85_11: 23.557,
    DY_S42_SGS85_11: (-140.844),
    DZ_S42_SGS85_11: (-79.778),
    RX_S42_SGS85_11: (-0.0023),
    RY_S42_SGS85_11: (-0.34646),
    RZ_S42_SGS85_11: (-0.79421),
    M_S42_SGS85_11: (-0.000000228),

    // СК-95  ->  WGS-84 (Count: 7)
    DX_S95_WGS84: 24.47,
    DY_S95_WGS84: (-130.89),
    DZ_S95_WGS84: (-81.56),
    RX_S95_WGS84: 0.0,
    RY_S95_WGS84: 0.0,
    RZ_S95_WGS84: (-0.13),
    M_S95_WGS84: (-0.00000022),

    // СК-42 -> WGS-84  (Count: 7)
    DX_S42_WGS84: 23.57,
    DY_S42_WGS84: (-140.95),
    DZ_S42_WGS84: (-79.8),
    RX_S42_WGS84: 0.0,
    RY_S42_WGS84: (-0.35),
    RZ_S42_WGS84: (-0.79),
    M_S42_WGS84: (-0.00000022),

    // MSK   -> WGS-84  (Count: 7)
    DX_MSK_WGS84: 24.0,
    DY_MSK_WGS84: (-123.0),
    DZ_MSK_WGS84: (-94.0),
    RX_MSK_WGS84: (-0.02),
    RY_MSK_WGS84: 0.25,
    RZ_MSK_WGS84: 0.13,
    M_MSK_WGS84: (-0.0000011),

    // ---------------------------------------------------------
    // VN-2000 -> WGS-84  (Count: 7)  "DoSM-Vnm"
    // ---------------------------------------------------------
    DX_VN2000_WGS84: -191.90441429,
    DY_VN2000_WGS84: -39.30318279,
    DZ_VN2000_WGS84: -111.45032835,
    RX_VN2000_WGS84: -0.00928836,
    RY_VN2000_WGS84: 0.01975479,
    RZ_VN2000_WGS84: -0.00427372,
    M_VN2000_WGS84: 0.000000252906278,

    // ---------------------------------------------------------
    // Nord Sahara 1959 -> WGS-84  (Count: 7)  "INCT-Dza" для EPSG:30729 - 30732
    // ---------------------------------------------------------
    DX_NS1959_WGS84: -209.362198,
    DY_NS1959_WGS84: -87.8162,
    DZ_NS1959_WGS84: 404.61983,
    RX_NS1959_WGS84: -0.00461215,
    RY_NS1959_WGS84: -3.47842207,
    RZ_NS1959_WGS84: -0.58048472,
    M_NS1959_WGS84: -0.000001454722,

    //  ИДЕНТИФИКАТОРЫ ОШИБОК ОБРАБОТКИ ЭЛЕКТРОННОЙ КАРТЫ
    IDS_PROJECTPARM: 60101,  // ОШИБОЧНЫЕ ДАННЫЕ О ПРОЕКЦИИ

    // Исправил для зон R - X
    FalseX: Object.freeze( [0., 12900.566, 16586.442, 11057.628, 14743.504,  //  1 - 4
        14743.504, 11057.628, 16586.442, 14743.504,                             //  5 - 8
        12900.566, 16586.442, 11057.628, 16586.422,                             //  9 - 12
        12900.566, 16586.422, 14743.504, 12900.566,                             // 13 - 16
        11057.628, 14743.504, 12900.566, 11057.628,                             // 17 - 20
        14743.504, 9414.690, 11057.628, 9214.690,                               // 21 - 24  // 29/05/14 X-> 9414.69 на 9214.69
        12900.566, 12900.566] ),                                                // 25 - 26

    FalseY: Object.freeze( [0, 300000, 300000, 250000, 250000,          //  1 - 4
        300000, 250000, 300000, 300000,                                     //  5 - 8
        250000, 400000, 300000, 500000,                                     //  9 - 12
        300000, 250000, 200000, 250000,                                     // 13 - 16
        400000, 300000, 400000, 300000,                                     // 17 - 20
        300000, 300000, 500000, 300000,                                     // 21 - 24
        250000, 300000] ),                                                    // 25 - 26

    GradMsk: Object.freeze( [0, 41, 75, 24, 38, 77, 97, 121, 47,             //  1 - 8
        71, 158, 64, 81, 79, 20, 29, 32,                                        //  9 - 16
        32, 43, 108, 37, 53, 49, 60, 23,                                        // 17 - 24
        62, 59] ),                                                              // 25 - 26

    MinMsk: Object.freeze( [0, 32, 13, 57, 33, 47, 2, 43, 46,                //  1 - 8
        44, 28, 43, 31, 28, 58, 3, 29,                                          //  9 - 16
        2, 3, 27, 59, 31, 2, 3, 30,                                             // 17 - 24
        1, 47] ),                                                               // 25 - 26

    WidthMsk: Object.freeze( [0, 3, 3, 3, 3, 3, 3, 3, 3,                     //  1 - 8
        3, 6, 3, 3, 3, 3, 3, 3,                                                 //  9 - 16
        6, 3, 6, 3, 3, 3, 6, 3,                                                 // 17 - 24
        3, 3] ),

    //*********************************************************************
    // Программы перевода координат X, Y точки и геодезических координат
    // точки B, L(специальная проекция - "Глобус")
    //*********************************************************************

    XC: 11888000.0,
    YC: 17376000.0,

    PCONST_03: 206264.806247,      // 1 sec]
    CONSTMOD: 0.434294481903251,//827651,
} );


export default TranslateConst;